src/cf/DataProcessors/уатПодборПараметровРасшифровкиПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатПодборПараметровРасшифровкиПлатежа</Name>
			<Comment>Подбор параметров расшифровки платежа (уат)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПлатежПоСуммеВзаиморасчетов</Name>
					<Comment>Определяет, будет ли пересчитываться сумма платежа при изменении суммы взаиморасчетов или наоборот</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодбиратьСумму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЗаявкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДляПодбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозникновения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДвиженияДокумента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Comment>(Общ) Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолга</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВходящегоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаказыНаТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаТС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолга</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>По счетам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуАрендаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/уатПодборПараметровРасшифровкиПлатежа/Forms/ФормаПодбораЗадолженностей/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// начало блока стандартных операций
	ДопПараметрыОткрытие = Новый Структура("ИмяФормы", ИмяФормы);
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций

	Если НЕ Параметры.Свойство("ДокументСсылка") Тогда
		Возврат;
	КонецЕсли;
	
	ДокументСсылка              = Параметры.ДокументСсылка;
	КурсДокумента               = Параметры.КурсДокумента;
	КратностьДокумента          = Параметры.КратностьДокумента;
	ТипЗадолженности            = Параметры.ТипЗадолженности;
	Контрагент                  = Параметры.Контрагент;
	БанковскийСчетКасса         = Параметры.БанковскийСчетКасса;
	Организация                 = Параметры.Организация;
	ВалютаДокумента             = Параметры.ВалютаДокумента;
	ДатаДок                     = Параметры.ДатаДок;
	СуммаДляПодбора             = Параметры.СуммаДляПодбора;
	ПлатежПоСуммеВзаиморасчетов = Параметры.ПлатежПоСуммеВзаиморасчетов;
	ЕстьПодбор                  = Параметры.ЕстьПодбор;
	ЗакрыватьПриВыборе          = Параметры.ЗакрыватьПриВыборе;
	Если Параметры.Свойство("ВидОперацииВозврат") Тогда
		ВидОперацииВозврат      = Параметры.ВидОперацииВозврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Параметры.РасшифровкаПлатежа Цикл
		НовСтрока = ДокументРасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
	КонецЦикла;
			
	РазнесениеПлатежейПоЗаказам = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(
		Организация, ПланыВидовХарактеристик.уатПраваИНастройки.РазнесениеПлатежейПоЗаказам)
		И ДокументСсылка.Метаданные().Имя <> "уатЗаявкаНаРасходованиеДС";
	Если РазнесениеПлатежейПоЗаказам Тогда
		Для Каждого ТекСтрока Из Параметры.Заказы Цикл
			НовСтрока = ДокументЗаказы.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
		КонецЦикла;
		Элементы.РасшифровкаПлатежаДерево.Отображение = ОтображениеТаблицы.Дерево;
	Иначе
		Элементы.РасшифровкаПлатежаДерево.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// начало блока стандартных операций
	уатЗащищенныеФункцииКлиент.уатОбработкаФормаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций
	
	// Если не установлено значения объекта редактируемого документа,
	// то форму обработки открывать не нужно.
	Если ДокументСсылка = Неопределено Тогда
		Отказ = Истина;
		ТекстНСТР = НСтр("en='Not specified the document to be processed! This processing is called from the form of the instrument.';ru='Не задан документ для обработки! Эта обработка вызывается из формы документа.'");
		ПоказатьПредупреждение(, ТекстНСТР);
		Возврат;
	КонецЕсли;
	
	Заголовок = ?(ТипЗадолженности=">0",НСтр("en='Accounts receivable';ru='Дебиторская'"),НСтр("en='Accounts payable';ru='Кредиторская'"))+" " + НСтр("en='debt. Selection for counterparty';ru='задолженность. Подбор для контрагента'") + " "+Контрагент;
	Элементы.РасшифровкаПлатежаСуммаПлатежа.Заголовок = СтрШаблон("Сумма платежа (%1)", ВалютаДокумента);
	Элементы.РасшифровкаПлатежаДеревоСуммаПлатежа.Заголовок = СтрШаблон("Разнесено, %1", ВалютаДокумента);
	
	ДопПараметрыКурса = уатОбщегоНазначенияТиповыеКлиент.ДопПараметрыКурсаВалюты(ВладелецФормы.Объект);
	
	СформироватьСписокДолгов();
	ПересчитатьИтоги();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДеревоОтметитьВсе(Команда)
	Для каждого ТекСтрока Из РасшифровкаПлатежаДерево.ПолучитьЭлементы() Цикл
		ТекСтрока.Выбран = Истина;
		ПриИзмененииРасшифровкаПлатежаДеревоВыбран(ТекСтрока);
	КонецЦикла;
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСнятьВсе(Команда)
	Для каждого ТекСтрока Из РасшифровкаПлатежаДерево.ПолучитьЭлементы() Цикл
		ТекСтрока.Выбран = Ложь;
		ПриИзмененииРасшифровкаПлатежаДеревоВыбран(ТекСтрока);
	КонецЦикла;
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРазвернутьВсе(Команда)
	Для Каждого ТекСтрока Из РасшифровкаПлатежаДерево.ПолучитьЭлементы() Цикл
		Элементы.РасшифровкаПлатежаДерево.Развернуть(ТекСтрока.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСвернутьВсе(Команда)
	Для Каждого ТекСтрока Из РасшифровкаПлатежаДерево.ПолучитьЭлементы() Цикл
		Элементы.РасшифровкаПлатежаДерево.Свернуть(ТекСтрока.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеРасшифровки(Команда)
	СформироватьСписокДолгов();
	ДеревоРазвернутьВсе(Неопределено);
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	мсвРасшифровкаПлатежа = Новый Массив;
	мсвЗаказыНаТС = Новый Массив;
	Для Каждого ТекСтрока Из РасшифровкаПлатежаДерево.ПолучитьЭлементы() Цикл
		Если НЕ ТекСтрока.Выбран Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("ДоговорКонтрагента",      ТекСтрока.ДоговорКонтрагента);
		СтруктураСтроки.Вставить("Сделка",                  ТекСтрока.Сделка);
		СтруктураСтроки.Вставить("СуммаПлатежа",            ТекСтрока.СуммаПлатежа);
		СтруктураСтроки.Вставить("СуммаВзаиморасчетов",     ТекСтрока.СуммаВзаиморасчетов);
		СтруктураСтроки.Вставить("ВалютаВзаиморасчетов",    ТекСтрока.Валюта);
		СтруктураСтроки.Вставить("КурсВзаиморасчетов",      ТекСтрока.КурсВзаиморасчетов);
		СтруктураСтроки.Вставить("КратностьВзаиморасчетов", ТекСтрока.КратностьВзаиморасчетов);
		СтруктураСтроки.Вставить("ЕстьПодбор", ЕстьПодбор);
		мсвРасшифровкаПлатежа.Добавить(СтруктураСтроки);
		
		Для Каждого ТекСтрокаЗаказ Из ТекСтрока.ПолучитьЭлементы() Цикл
			СтруктураСтрокиЗаказ = Новый Структура;
			СтруктураСтрокиЗаказ.Вставить("ДоговорКонтрагента",   ТекСтрока.ДоговорКонтрагента);
			СтруктураСтрокиЗаказ.Вставить("ВалютаВзаиморасчетов", ТекСтрока.Валюта);
			СтруктураСтрокиЗаказ.Вставить("Сделка",               ТекСтрока.Сделка);
			СтруктураСтрокиЗаказ.Вставить("ЗаказНаТС",            ТекСтрокаЗаказ.Сделка);
			СтруктураСтрокиЗаказ.Вставить("СуммаПлатежа",         ТекСтрокаЗаказ.СуммаПлатежа);
			СтруктураСтрокиЗаказ.Вставить("СуммаВзаиморасчетов",  ТекСтрокаЗаказ.СуммаВзаиморасчетов);
			мсвЗаказыНаТС.Добавить(СтруктураСтрокиЗаказ);
		КонецЦикла;
	КонецЦикла;
	
	Рез = Новый Структура("РасшифровкаПлатежа, ЗаказыНаТС", мсвРасшифровкаПлатежа, мсвЗаказыНаТС);
	Закрыть(Рез);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_РасшифровкаПлатежа

&НаКлиенте
Процедура РасшифровкаПлатежаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Перем КурсВзаиморасчетов,КратностьВзаиморасчетов,СуммаПлатежа,СуммаВзаиморасчетов;
	
	СтрокаДоговор = Элемент.ТекущиеДанные;
	
	//Если СтрокаДоговор.Валюта <> ВалютаДокумента Тогда
	//	ТекстНСТР = НСтр("en='Allowed selection of debt only in document currency';ru='Разрешен подбор задолженности только в валюте документа'");
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
	//	Возврат;
	//КонецЕсли;
		
	ДоговорКонтрагента      = СтрокаДоговор.ДоговорКонтрагента;
	Сделка                  = СтрокаДоговор.Сделка;
	КратностьВзаиморасчетов = СтрокаДоговор.КратностьВзаиморасчетов;
	
	СуммаПлатежа        = СтрокаДоговор.СуммаПлатежа;
	КурсВзаиморасчетов  = СтрокаДоговор.КурсВзаиморасчетов;
	СуммаВзаиморасчетов = СтрокаДоговор.СуммаВзаиморасчетов;
	
	СтруктураПодбора = Новый Структура;
	СтруктураПодбора.Вставить("ДоговорКонтрагента",      ДоговорКонтрагента);
	СтруктураПодбора.Вставить("Сделка",                  Сделка);
	СтруктураПодбора.Вставить("СуммаПлатежа",            СуммаПлатежа);
	СтруктураПодбора.Вставить("СуммаВзаиморасчетов",     СуммаВзаиморасчетов);
	СтруктураПодбора.Вставить("ВалютаВзаиморасчетов",    СтрокаДоговор.Валюта);
	СтруктураПодбора.Вставить("КурсВзаиморасчетов",      КурсВзаиморасчетов);
	СтруктураПодбора.Вставить("КратностьВзаиморасчетов", КратностьВзаиморасчетов);
	СтруктураПодбора.Вставить("ЕстьПодбор", ЕстьПодбор);
	Объект.РасшифровкаПлатежа.Удалить(СтрокаДоговор);
	ОповеститьОВыборе(СтруктураПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РасшифровкаПлатежаДеревоСделка" Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(Неопределено, РасшифровкаПлатежаДерево.НайтиПоИдентификатору(ВыбраннаяСтрока).Сделка);
	ИначеЕсли Поле.Имя = "РасшифровкаПлатежаДеревоДоговорКонтрагента" Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(Неопределено, РасшифровкаПлатежаДерево.НайтиПоИдентификатору(ВыбраннаяСтрока).ДоговорКонтрагента);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДеревоВыбранПриИзменении(Элемент)
	ТекСтрока = Элементы.РасшифровкаПлатежаДерево.ТекущиеДанные;
	ПриИзмененииРасшифровкаПлатежаДеревоВыбран(ТекСтрока);
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРасшифровкаПлатежаДеревоВыбран(ТекСтрока)
	СтрокаРодитель = ТекСтрока.ПолучитьРодителя();
	Если СтрокаРодитель = Неопределено Тогда // уровень сделок
		Если ТекСтрока.Выбран Тогда
			Если ТекСтрока.СуммаПлатежа = 0 Тогда
				ТекСтрока.СуммаВзаиморасчетов = ТекСтрока.СуммаДолга;
				
				// Получаем Курс и Кратность ВалютыДокумента индивидуально для каждой строки Расшифровки,
				// т.к. дата курса в строках может быть разной
				ТекДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(
					ДатаДок, ТекСтрока.ДоговорКонтрагента, ТекСтрока.Сделка);
				КурсКратностьДок = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
					ВалютаДокумента, ТекДатаКурса, ДопПараметрыКурса);
				
				ТекСтрока.СуммаПлатежа = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(
					ТекСтрока.СуммаВзаиморасчетов,
					ТекСтрока.Валюта,                  ВалютаДокумента,
					ТекСтрока.КурсВзаиморасчетов,      КурсКратностьДок.Курс,
					ТекСтрока.КратностьВзаиморасчетов, КурсКратностьДок.Кратность,,
					ДопПараметрыКурса);
			КонецЕсли;
		Иначе
			ТекСтрока.СуммаВзаиморасчетов = 0;
			ТекСтрока.СуммаПлатежа = 0;
		КонецЕсли;
		Для Каждого ТекСтрокаЗаказ Из ТекСтрока.ПолучитьЭлементы() Цикл
			ТекСтрокаЗаказ.Выбран = ТекСтрока.Выбран;
			Если ТекСтрокаЗаказ.Выбран Тогда
				Если ТекСтрокаЗаказ.СуммаПлатежа = 0 Тогда
					ТекСтрокаЗаказ.СуммаВзаиморасчетов = ТекСтрокаЗаказ.СуммаДолга;
					
					// Получаем Курс и Кратность ВалютыДокумента индивидуально для каждой строки Расшифровки,
					// т.к. дата курса в строках может быть разной
					ТекДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(
						ДатаДок, ТекСтрока.ДоговорКонтрагента, ТекСтрока.Сделка);
					КурсКратностьДок = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
						ВалютаДокумента, ТекДатаКурса, ДопПараметрыКурса);
						
					ТекСтрокаЗаказ.СуммаПлатежа = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(
						ТекСтрокаЗаказ.СуммаВзаиморасчетов,
						ТекСтрокаЗаказ.Валюта,             ВалютаДокумента,
						ТекСтрока.КурсВзаиморасчетов,      КурсКратностьДок.Курс,
						ТекСтрока.КратностьВзаиморасчетов, КурсКратностьДок.Кратность,,
						ДопПараметрыКурса);
				КонецЕсли;
			Иначе
				ТекСтрокаЗаказ.СуммаВзаиморасчетов = 0;
				ТекСтрокаЗаказ.СуммаПлатежа = 0;
			КонецЕсли;
		КонецЦикла;
	Иначе // уровень заказов
		Если ТекСтрока.Выбран Тогда
			Если ТекСтрока.СуммаПлатежа = 0 Тогда
				ТекСтрока.СуммаВзаиморасчетов = ТекСтрока.СуммаДолга;
				
				// Получаем Курс и Кратность ВалютыДокумента индивидуально для каждой строки Расшифровки,
				// т.к. дата курса в строках может быть разной
				ТекДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(
					ДатаДок, СтрокаРодитель.ДоговорКонтрагента, СтрокаРодитель.Сделка);
				КурсКратностьДок = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
					ВалютаДокумента, ТекДатаКурса, ДопПараметрыКурса);
					
				ТекСтрока.СуммаПлатежа = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(
					ТекСтрока.СуммаВзаиморасчетов,
					ТекСтрока.Валюта,                       ВалютаДокумента,
					СтрокаРодитель.КурсВзаиморасчетов,      КурсКратностьДок.Курс,
					СтрокаРодитель.КратностьВзаиморасчетов, КурсКратностьДок.Кратность,,
					ДопПараметрыКурса);
			КонецЕсли;
		Иначе
			ТекСтрока.СуммаВзаиморасчетов = 0;
			ТекСтрока.СуммаПлатежа = 0;
		КонецЕсли;
				
		флВыбранРодитель = Ложь;
		СтрокаРодитель.СуммаПлатежа = 0;
		СтрокаРодитель.СуммаВзаиморасчетов = 0;
		Для Каждого ТекСтрокаЗаказ Из СтрокаРодитель.ПолучитьЭлементы() Цикл
			флВыбранРодитель = флВыбранРодитель ИЛИ ТекСтрокаЗаказ.Выбран;
			Если ТекСтрокаЗаказ.Выбран Тогда
				СтрокаРодитель.СуммаПлатежа = СтрокаРодитель.СуммаПлатежа + ТекСтрокаЗаказ.СуммаПлатежа;
				СтрокаРодитель.СуммаВзаиморасчетов = СтрокаРодитель.СуммаВзаиморасчетов + ТекСтрокаЗаказ.СуммаВзаиморасчетов;
			КонецЕсли;
		КонецЦикла;
		СтрокаРодитель.Выбран = флВыбранРодитель;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДеревоСуммаПлатежаПриИзменении(Элемент)
	ТекСтрока = Элементы.РасшифровкаПлатежаДерево.ТекущиеДанные;
	Если ВалютаДокумента = ТекСтрока.Валюта Тогда
		ТекСтрока.СуммаВзаиморасчетов = ТекСтрока.СуммаПлатежа;
	Иначе
		// Получаем Курс и Кратность ВалютыДокумента индивидуально для каждой строки Расшифровки,
		// т.к. дата курса в строках может быть разной
		ДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(
			ДатаДок, ТекСтрока.ДоговорКонтрагента, ТекСтрока.Сделка);
		КурсКратностьДок = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			ВалютаДокумента, ДатаКурса, ДокументСсылка);
			
		ТекСтрока.СуммаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(
			ТекСтрока.СуммаПлатежа,
			ВалютаДокумента,            ТекСтрока.Валюта,
			КурсКратностьДок.Курс,      ТекСтрока.КурсВзаиморасчетов,
			КурсКратностьДок.Кратность, ТекСтрока.КратностьВзаиморасчетов,,
			ДопПараметрыКурса);
	КонецЕсли;
	
	ПриИзмененииРасшифровкаПлатежаДеревоСумма(ТекСтрока);
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаДеревоСуммаВзаиморасчетовПриИзменении(Элемент)
	ТекСтрока = Элементы.РасшифровкаПлатежаДерево.ТекущиеДанные;
	Если ВалютаДокумента = ТекСтрока.Валюта Тогда
		ТекСтрока.СуммаПлатежа = ТекСтрока.СуммаВзаиморасчетов;
	Иначе
		// Получаем Курс и Кратность ВалютыДокумента индивидуально для каждой строки Расшифровки,
		// т.к. дата курса в строках может быть разной
		ДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(
			ДатаДок, ТекСтрока.ДоговорКонтрагента, ТекСтрока.Сделка);
		КурсКратностьДок = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(
			ВалютаДокумента, ДатаКурса, ДокументСсылка);
			
		ТекСтрока.СуммаПлатежа = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(
			ТекСтрока.СуммаВзаиморасчетов,
			ТекСтрока.Валюта,                  ВалютаДокумента,
			ТекСтрока.КурсВзаиморасчетов,      КурсКратностьДок.Курс,
			ТекСтрока.КратностьВзаиморасчетов, КурсКратностьДок.Кратность,,
			ДопПараметрыКурса);
	КонецЕсли;
	
	ПриИзмененииРасшифровкаПлатежаДеревоСумма(ТекСтрока);
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРасшифровкаПлатежаДеревоСумма(ТекСтрока)
	Если ЗначениеЗаполнено(ТекСтрока.СуммаПлатежа) И НЕ ТекСтрока.Выбран Тогда
		ТекСтрока.Выбран = Истина;
		ПриИзмененииРасшифровкаПлатежаДеревоВыбран(ТекСтрока);
		Возврат;
	КонецЕсли;
	
	СтрокаРодитель = ТекСтрока.ПолучитьРодителя();
	Если СтрокаРодитель = Неопределено Тогда // уровень сделок
		СуммаПлатежаПред = 0;
		Для Каждого ТекСтрокаЗаказ Из ТекСтрока.ПолучитьЭлементы() Цикл
			СуммаПлатежаПред = СуммаПлатежаПред + ТекСтрокаЗаказ.СуммаПлатежа;
		КонецЦикла;
		Если СуммаПлатежаПред <> 0 Тогда
			Для Каждого ТекСтрокаЗаказ Из ТекСтрока.ПолучитьЭлементы() Цикл
				ТекСтрокаЗаказ.СуммаПлатежа = ТекСтрокаЗаказ.СуммаПлатежа * ТекСтрока.СуммаПлатежа / СуммаПлатежаПред;
				ТекСтрокаЗаказ.СуммаВзаиморасчетов = ТекСтрокаЗаказ.СуммаВзаиморасчетов * ТекСтрока.СуммаПлатежа / СуммаПлатежаПред;
			КонецЦикла;
		КонецЕсли;
	Иначе // уровень заказов
		СтрокаРодитель.СуммаПлатежа = 0;
		СтрокаРодитель.СуммаВзаиморасчетов = 0;
		Для Каждого ТекСтрокаЗаказ Из СтрокаРодитель.ПолучитьЭлементы() Цикл
			СтрокаРодитель.СуммаПлатежа = СтрокаРодитель.СуммаПлатежа + ТекСтрокаЗаказ.СуммаПлатежа;
			СтрокаРодитель.СуммаВзаиморасчетов = СтрокаРодитель.СуммаВзаиморасчетов + ТекСтрокаЗаказ.СуммаВзаиморасчетов;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Отбирает неоплаченные задолженности из сформированной таблицы для подбора.
//
&НаСервере
Процедура СформироватьСписокДолгов() 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДокументСсылка",             ДокументСсылка);
	СтруктураПараметров.Вставить("Организация",                Организация);
	СтруктураПараметров.Вставить("Контрагент",                 Контрагент);
	СтруктураПараметров.Вставить("ВалютаДокумента",            ВалютаДокумента);
	СтруктураПараметров.Вставить("КурсДокумента",              КурсДокумента);
	СтруктураПараметров.Вставить("КратностьДокумента",         КратностьДокумента);
	СтруктураПараметров.Вставить("ТипЗадолженности",           ТипЗадолженности);
	СтруктураПараметров.Вставить("ДатаДок",                    ДатаДок);
	СтруктураПараметров.Вставить("ЕстьПодбор",                 ЕстьПодбор);
	СтруктураПараметров.Вставить("ДокументРасшифровкаПлатежа", ДокументРасшифровкаПлатежа.Выгрузить());
	СтруктураПараметров.Вставить("ДокументЗаказы",             ДокументЗаказы.Выгрузить());
	СтруктураПараметров.Вставить("ДопПараметрыКурса",          ДопПараметрыКурса);
	СтруктураПараметров.Вставить("ВидОперацииВозврат",         ВидОперацииВозврат);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Обработки.уатПодборПараметровРасшифровкиПлатежа.СформироватьСписокДолгов(ОбработкаОбъект, СтруктураПараметров);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	СформироватьДеревоДолгов(СтруктураПараметров);

КонецПроцедуры // СформироватьСписокДолгов() 

&НаСервере
Процедура СформироватьДеревоДолгов(СтруктураПараметров)
	
	РасшифровкаПлатежаДерево.ПолучитьЭлементы().Очистить();
	
	Для Каждого ТекСтрока Из Объект.РасшифровкаПлатежа Цикл
		НоваяСтрокаДерева = РасшифровкаПлатежаДерево.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, ТекСтрока);
		НоваяСтрокаДерева.ВедениеВзаиморасчетовПоДоговору = (НоваяСтрокаДерева.ДоговорКонтрагента.ВедениеВзаиморасчетов
			= Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
		Если ТекСтрока.ВидВзаиморасчетов = "Текущий документ" Тогда
			НоваяСтрокаДерева.Выбран = Истина;
		КонецЕсли;
		
		СтруктураПоиск = Новый Структура("Сделка, ДоговорКонтрагента, Валюта",
			ТекСтрока.Сделка, ТекСтрока.ДоговорКонтрагента, ТекСтрока.Валюта);
		мсвСтрокиЗаказы = Объект.ЗаказыНаТС.НайтиСтроки(СтруктураПоиск);
		Для Каждого ТекСтрокаЗаказ Из мсвСтрокиЗаказы Цикл
			НоваяСтрокаДереваЗаказ = НоваяСтрокаДерева.ПолучитьЭлементы().Добавить();
			НоваяСтрокаДереваЗаказ.Сделка              = ТекСтрокаЗаказ.ЗаказНаТС;
			НоваяСтрокаДереваЗаказ.ДоговорКонтрагента  = ТекСтрокаЗаказ.ДоговорКонтрагента;
			НоваяСтрокаДереваЗаказ.Валюта              = ТекСтрока.Валюта;
			НоваяСтрокаДереваЗаказ.ВалютаПредставление = ТекСтрока.ВалютаПредставление;
			НоваяСтрокаДереваЗаказ.Выбран              = ТекСтрокаЗаказ.Выбран;
			НоваяСтрокаДереваЗаказ.СуммаВзаиморасчетов = ТекСтрокаЗаказ.СуммаВзаиморасчетов;
			НоваяСтрокаДереваЗаказ.СуммаПлатежа        = ТекСтрокаЗаказ.СуммаПлатежа;
			НоваяСтрокаДереваЗаказ.СуммаДолга          = ТекСтрокаЗаказ.СуммаДолга;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтоги()
	
	СуммаРазнесено = 0;
	Для Каждого ТекСтрока Из РасшифровкаПлатежаДерево.ПолучитьЭлементы() Цикл
		Если ТекСтрока.Выбран Тогда
			СуммаРазнесено = СуммаРазнесено + ТекСтрока.СуммаПлатежа;
		КонецЕсли;
	КонецЦикла;
	СуммаОсталосьРазнести = СуммаДляПодбора - СуммаРазнесено;
	
	Если КратностьДокумента = 0 Тогда
		ПредставлениеКурса = Формат(КурсДокумента, "ЧДЦ=4; ЧН=0,0000");
	ИначеЕсли КурсДокумента = 1 И КратностьДокумента = 1 Тогда
		ПредставлениеКурса = "";
	Иначе
		ПредставлениеКурса = Формат(КурсДокумента / КратностьДокумента, "ЧДЦ=4; ЧН=0,0000");
	КонецЕсли;
	ВалютаПредставление = "" + ВалютаДокумента + ?(ПустаяСтрока(ПредставлениеКурса), "", " (" + ПредставлениеКурса + ")");
	
КонецПроцедуры

#КонецОбласти
